Tekla Open API Reference for Tekla Structures 2025
RectangleBoundingBox Methods
The RectangleBoundingBox type exposes the following members.
Methods
Name | Description
Collide
 Checks if the current axis-aligned 3d bounding box collides with another given axis-aligned 3d bounding box. Both axis-aligned 3d bounding boxes need to be in the same coordinate system or in the same workplane, so that they are defined using the same axes.
 (Inherited from AABB.)
CreateRectangleBoundingBox
 Creates a new RectangleBoundingBox with the given values.
GetCenterPoint
 Returns the geometric center point of the current axis-aligned 3d bounding box.
 (Inherited from AABB.)
GetCornerPoints
 Returns all corner points of the current axis-aligned 3d bounding box.
 (Inherited from AABB.)
IsEqual
 Compares the current object with an object of the same type.
IsInside(LineSegment)
 Checks if the given line segment is inside the current axis-aligned 3d bounding box.
 (Inherited from AABB.)
IsInside(Point)
 Checks if the given point is inside the current axis-aligned 3d bounding box.
 (Inherited from AABB.)
ToString
 Returns the rectangle bounding box values as a string.
 (Overrides Object.ToString().)
Top
See Also
Reference
RectangleBoundingBox Class
Tekla.Structures.Drawing Namespace